app/Helpers/retrieve_helper.php

SELECT *
FROM `visa-visa`
WHERE `visa-visa`.`id` = '1'
---
    function getVisaTypeName($id)
    {
        $model = model(VisaModel::class);
        $visa = $model->find($id);