app/Controllers/Api.php

SELECT *
FROM `visa-visa`
---
    public function getVisaTypes() {
        $model = model(VisaModel::class);
        $visas = $model->findAll();