app/Controllers/Visa.php

SELECT *
FROM `visa-visa`
WHERE `visa-visa`.`id` = '2'
---
    public function getVisaRequirements() //Get requirements for a visa as JSON Array
    {
        try
        {
            $visaId = $_GET['visaId'] ?? null;
            if(isset($visaId))
            {
                $model = model(VisaModel::class);
                $visa = $model->find($visaId);